{
  "backend/main.mo": "Motoko actor exposing three AI generation endpoints (screenplay, character profiles, production plan) that send prompts to the OpenAI chat completions API via HTTP outcalls, plus a transform function for response canonicalization.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (dashboard UI, PDF export, TXT export, cinematic theme) to their associated source files, components, and test IDs with confidence ratings.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of every frontend source file, serving as a quick reference index for the project's React components, hooks, utilities, and styles.",
  "frontend/index.css": "Base Tailwind CSS file defining OKLCH color tokens for light and dark themes across background, foreground, card, sidebar, and chart variables.",
  "frontend/index.html": "Minimal HTML entry point for the Scriptoria Vite/React app, mounting the React root div and loading the main TSX module.",
  "frontend/src/App.tsx": "Root Scriptoria application component that orchestrates the hero section, idea input, parallel AI generation via useGenerateAll, content panels display, and success/error toast notifications within a QueryClientProvider.",
  "frontend/src/components/CharacterProfilesPanel.tsx": "Panel component that parses AI-generated character profile text into structured cards with color-coded avatars, role badges, and sectioned profile data (personality, backstory, motivation), with a shimmer skeleton loading state.",
  "frontend/src/components/ContentPanels.tsx": "Container component that renders all three result panels (Screenplay, Characters, Production) as a tabbed interface on mobile and a three-column grid on desktop with cinematic card styling.",
  "frontend/src/components/HeroSection.tsx": "Renders the cinematic hero header with a background image, gradient overlays, film strip decorations, logo, title, and tagline for the Scriptoria app.",
  "frontend/src/components/IdeaInput.tsx": "Provides a textarea input for users to enter a film idea, with example idea chips, character count, and a generate button that triggers the onGenerate callback.",
  "frontend/src/components/LoadingSkeleton.tsx": "Exports animated shimmer skeleton components (ScreenplaySkeleton, CharactersSkeleton, ProductionPlanSkeleton) used as loading placeholders for each content panel.",
  "frontend/src/components/ProductionPlanPanel.tsx": "Displays the generated production plan content with markdown-aware formatting (headings, bullets, numbered lists) and a download-as-TXT button.",
  "frontend/src/components/ScreenplayPanel.tsx": "Renders the generated screenplay with formatting for scene headings, character names, parentheticals, and dialogue, plus a PDF export button.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both authenticated (Internet Identity) and anonymous actors, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on ICP, managing login/logout state, identity persistence, and AuthClient configuration.",
  "frontend/src/hooks/useQueries.ts": "Defines a `useGenerateAll` mutation hook that calls three backend actor methods (screenplay, character profiles, production plan) in parallel given a film idea string.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base/component layers with a cinematic dark theme using gold and charcoal CSS custom properties.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/utils/pdfExport.ts": "Exports a screenplay string as a formatted A4 PDF by dynamically loading jsPDF from CDN and applying scene-heading and character-name styling.",
  "frontend/src/utils/textExport.ts": "Exports a production plan string as a plain-text `.txt` file with a formatted header/footer, triggering a browser download via a Blob URL.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with cinematic gold/charcoal color palettes, film-inspired font families, custom shadows, gradients, and keyframe animations.",
  "project_state.json": "Tracks the current project state for Scriptoria, listing implemented features (dashboard, PDF export, production plan download, responsive UI, tabbed panels) and architectural notes about OpenAI-powered generation."
}